Merge pull request #89 from s-toufik/88-feature---documentation
update the doc
